{"id":"421b1ea4-41ad-4d66-9b81-adae903f46f7","script":"Armand Junior Dongmo Notue is a data scientist with a strong background in machine learning and deep learning. His expertise includes areas such as supervised and unsupervised learning, reinforcement learning, natural language processing (NLP), and cloud computing. With experience in real-time AI solutions development, he has demonstrated proficiency in deploying ML pipelines and optimizing predictive models to drive business impact. Notue is passionate about leveraging transformers and MLOps for complex challenges and holds a Master of Science in Data Science from Grand Canyon University and a Bachelor's degree in Petroleum Engineering from the University of Douala. His professional experience includes roles as a data scientist at Outlier, where he optimized AI models to improve accuracy by 15%, and an intern at African Think Tank, where he led data collection and survey analysis. Notue has developed several impactful projects, including a transformer-based NLP model for sentiment analysis, which achieved 88.3% accuracy; an AI-driven job market insights platform that improved hiring strategies by 20%; and a real-time fraud detection system that increased fraud detection accuracy by 35%. His technical skills span machine learning algorithms, NLP tools like BERT and GPT, data analytics techniques, cloud platforms such as AWS SageMaker, and programming languages including Python and TensorFlow. Notue also holds several certificates from prestigious institutions, further enhancing his expertise in the field of data science and machine learning.","voice":"emma","speed":1,"backgroundMusic":false,"musicType":"none","analysis":{"wordCount":744,"sentenceCount":35,"paragraphCount":1,"characterCount":6081,"readingTime":3,"complexity":"medium","contentType":"technical","contentHash":"560316a15f7c11a1440e1cec7586c9d1","estimatedTokens":2027,"metadata":{"avgWordsPerSentence":21.26,"avgSentencesPerParagraph":35}},"audio":null,"createdAt":"2025-09-06T17:02:09.711Z"}
