{"id":"6fe44999-3561-4969-8126-133e6309591c","script":"Armand Junior Dongmo Notue is a Data Scientist with extensive expertise in Machine Learning, Deep Learning, Natural Language Processing (NLP), and AI. His key skills include developing real-time AI solutions, optimizing predictive models, deploying ML pipelines, and leveraging MLOps to drive business impact. With a background in statistical analysis, data mining, feature engineering, and cloud computing, Notue is proficient in tools such as Python, TensorFlow, Keras, PyTorch, and Tableau. Notue's professional experience includes roles as a Data Scientist and AI Trainer at Outlier, where he has optimized model accuracy by 15% through real-time evaluation. He also led data analytics internships at African Think Tank, improving program effectiveness by 30%. Notue is currently pursuing his Master of Science in Data Science from Grand Canyon University and holds relevant degrees in Petroleum Engineering and Reservoir Management. His projects showcase his capability to solve complex challenges using advanced techniques. For instance, he developed a BERT-based NLP model for sentiment analysis with an accuracy of 88.3%, and implemented an AI-driven job market insights platform that improved hiring strategies by 20%. Notue has also created a real-time fraud detection system that increased detection accuracy by 35% and built time series forecasting models to optimize retail sales. Notue's professional affiliations include memberships in the American Statistical Association, IEEE Computer Society, and the Association for the Advancement of Artificial Intelligence. He has completed several data science and machine learning courses from prestigious institutions like Harvard University, Google, and Coursera, further enhancing his technical skills and knowledge base.","voice":"emma_en","speed":1,"backgroundMusic":false,"musicType":"none","analysis":{"wordCount":744,"sentenceCount":35,"paragraphCount":1,"characterCount":6081,"readingTime":3,"complexity":"medium","contentType":"technical","contentHash":"560316a15f7c11a1440e1cec7586c9d1","estimatedTokens":2027,"metadata":{"avgWordsPerSentence":21.26,"avgSentencesPerParagraph":35}},"audio":null,"createdAt":"2025-09-07T08:37:19.791Z"}
