{"id":"93e8a84a-d394-4715-a033-93cf17a0b487","script":"Armand Junior Dongmo Notue is a Data Scientist with extensive expertise in Machine Learning, Deep Learning, Natural Language Processing (NLP), and Reinforcement Learning. His professional background includes developing real-time AI solutions, deploying machine learning pipelines, and optimizing predictive models to drive business impact. Notue has hands-on experience in cloud computing, statistical analysis, data mining, feature engineering, and MLOps practices.\n\nHis technical skills encompass a wide range of areas including supervised and unsupervised learning techniques such as XGBoost, RNNs, CNNs, LSTMs, GANs; NLP tasks like named entity recognition, sentiment analysis, text summarization, and speech-to-text conversion; data analytics methods like clustering, association rule mining, AB testing, and PCA. Notue also has proficiency in cloud platforms such as AWS SageMaker, Docker, Kubernetes, Apache Spark, and automated ML pipelines on AWS and GCP. His projects include building a transformer-based NLP model for sentiment analysis, creating an AI-driven job market insights platform, developing a real-time fraud detection system, optimizing retail sales forecasting using time series models, implementing custom neural networks, performing customer segmentation with clustering techniques, and enhancing feature engineering for deep learning models.\n\nNotue's professional affiliations include memberships in the American Statistical Association (ASA), IEEE Computer Society, and the Association for the Advancement of Artificial Intelligence (AAAI). He holds relevant certificates from prestigious institutions such as Harvard University and Coursera, further validating his expertise.","voice":"emma","speed":1,"backgroundMusic":false,"musicType":"none","analysis":{"wordCount":744,"sentenceCount":35,"paragraphCount":1,"characterCount":6081,"readingTime":3,"complexity":"medium","contentType":"technical","contentHash":"560316a15f7c11a1440e1cec7586c9d1","estimatedTokens":2027,"metadata":{"avgWordsPerSentence":21.26,"avgSentencesPerParagraph":35}},"createdAt":"2025-09-05T22:18:16.353Z"}
