{"id":"9d917fde-7084-4c32-9038-83d5b9ca2741","script":"Armand Junior Dongmo Notue is a Data Scientist with extensive expertise in Machine Learning, Deep Learning, NLP, and AI. His professional background showcases his ability to develop and deploy real-time AI solutions, optimize predictive models, and drive significant business impact through data-driven strategies. Key skills include proficiency in various machine learning algorithms (Supervised and Unsupervised Learning, Reinforcement Learning), natural language processing techniques (BERT, GPT, T5), deep neural networks (CNNs, RNNs, LSTMs), and cloud computing platforms like AWS SageMaker. Notue's work experience highlights his hands-on capabilities in data analytics and AI training. As a Data Scientist at Outlier, he has optimized model performance by 15% through real-time evaluation and feedback. His role as an Intern at African Think Tank involved automating Tableau dashboards to streamline reporting and enhancing marketing strategies with AB testing. Notue's projects span diverse applications such as transformer-based NLP models for sentiment analysis, AI-driven job market insights platforms, real-time fraud detection systems, time series forecasting for retail sales optimization, custom neural network implementations, customer segmentation using clustering techniques, and feature engineering for deep learning models. Notue holds a Master of Science in Data Science from Grand Canyon University and a Bachelor's degree in Petroleum Engineering from the University of Douala. He is also pursuing advanced certificates in data science and machine learning from prestigious institutions such as Harvard University and Coursera. His professional affiliations include memberships in the American Statistical Association, IEEE Computer Society, and the Association for the Advancement of Artificial Intelligence.","voice":"default_en","speed":1,"backgroundMusic":false,"musicType":"none","analysis":{"wordCount":744,"sentenceCount":35,"paragraphCount":1,"characterCount":6081,"readingTime":3,"complexity":"medium","contentType":"technical","contentHash":"560316a15f7c11a1440e1cec7586c9d1","estimatedTokens":2027,"metadata":{"avgWordsPerSentence":21.26,"avgSentencesPerParagraph":35}},"audio":null,"createdAt":"2025-09-07T21:03:44.516Z"}
