{"id":"b30526b4-74fb-4c30-9fe1-2ce391ee997d","script":"Armand Junior Dongmo Notue is a Data Scientist with expertise in Machine Learning, Deep Learning, NLP, and AI. His professional experience includes roles such as Data Scientist at Outlier and Data Analytics Intern at African Think Tank, where he demonstrated his ability to optimize models and automate processes for enhanced decision-making. He has developed real-time solutions like fraud detection systems and NLP models that significantly improved accuracy and efficiency. Notue's skills encompass a wide range of areas including machine learning techniques (Supervised and Unsupervised Learning, Reinforcement Learning), natural language processing methods (BERT, GPT, T5), data analytics tools (Clustering, AB Testing), and cloud technologies (AWS SageMaker). He has hands-on experience in implementing these through various projects, such as building a sentiment analysis model with BERT and LSTM layers, creating an AI-driven job market insights platform using NLP models, developing real-time fraud detection systems with Autoencoders, and forecasting retail sales using ARIMA and LSTM models. His technical skills are complemented by proficiency in programming languages like Python and tools such as TensorFlow, PyTorch, and Tableau. Notue is also actively pursuing advanced certifications in data science and machine learning from prestigious institutions including Harvard University, Google, and Coursera. He holds a Master of Science in Data Science from Grand Canyon University and previously earned a Bachelor's degree in Petroleum Engineering and a Master of Engineering in Reservoir Management. His professional affiliations include membership in the American Statistical Association, IEEE Computer Society, and the Association for the Advancement of Artificial Intelligence.","voice":"default_en","speed":1,"backgroundMusic":false,"musicType":"none","analysis":{"wordCount":744,"sentenceCount":35,"paragraphCount":1,"characterCount":6081,"readingTime":3,"complexity":"medium","contentType":"technical","contentHash":"560316a15f7c11a1440e1cec7586c9d1","estimatedTokens":2027,"metadata":{"avgWordsPerSentence":21.26,"avgSentencesPerParagraph":35}},"audio":null,"createdAt":"2025-09-07T08:55:20.064Z"}
