{"id":"cb942e48-60a8-4fd3-bb9f-4083a2132068","script":"Armand Junior Dongmo Notue is a Data Scientist specializing in Machine Learning, Deep Learning, NLP, and Reinforcement Learning. With a background in statistical analysis, data mining, and feature engineering, he has demonstrated proficiency in developing real-time AI solutions and deploying ML pipelines to drive business impact. His key skills include expertise in various machine learning algorithms (Supervised/Unsupervised Learning, XGBoost, GANs), NLP techniques (BERT, GPT, T5, Word2Vec, GloVe), data analytics tools (Clustering, AB Testing, PCA), and cloud technologies (AWS SageMaker, Docker, Kubernetes). Notue has hands-on experience in a range of projects, including building transformer-based NLP models for sentiment analysis, developing an AI-driven job market insights platform using Hugging Face and spaCy, implementing real-time fraud detection systems with Autoencoders and Isolation Forests, and conducting time series forecasting to optimize retail sales. His professional affiliations include memberships in the American Statistical Association, IEEE Computer Society, and the Association for the Advancement of Artificial Intelligence. Key achievements highlight his ability to enhance model accuracy significantly; for instance, he increased fraud detection by 35% and improved sentiment monitoring with a BERT model achieving 88.3% accuracy. Notue's educational background comprises a Master of Science in Data Science from Grand Canyon University and a Master of Engineering in Reservoir Management from the University of Douala, complemented by numerous certifications from platforms like Coursera and Harvard EDX.","voice":"default_en","speed":1,"backgroundMusic":false,"musicType":"none","analysis":{"wordCount":744,"sentenceCount":35,"paragraphCount":1,"characterCount":6081,"readingTime":3,"complexity":"medium","contentType":"technical","contentHash":"560316a15f7c11a1440e1cec7586c9d1","estimatedTokens":2027,"metadata":{"avgWordsPerSentence":21.26,"avgSentencesPerParagraph":35}},"audio":{"audioId":"chatterbox_en_02637edd","audioUrl":"/audio/chatterbox_en_02637edd.wav","duration":96,"fileSize":4608078,"model":"Chatterbox-Multilingual-Advanced"},"createdAt":"2025-09-08T01:22:57.345Z"}
