{"id":"d2bbab97-6f1a-434d-bd36-42dccb8a8b5a","script":"Armand Junior Dongmo Notue is a Data Scientist with extensive expertise in Machine Learning, Deep Learning, Natural Language Processing (NLP), and Reinforcement Learning. His professional background includes developing real-time AI solutions, optimizing predictive models, and deploying machine learning pipelines to drive business impact. He has demonstrated proficiency in various tools and technologies such as Python, TensorFlow, PyTorch, and Hugging Face transformers, along with cloud computing platforms like AWS SageMaker. Key skills highlighted include expertise in supervised and unsupervised learning techniques, NLP methods (BERT, GPT, T5), time-series forecasting, and MLOps practices. Notue has hands-on experience in a range of projects including transformer-based sentiment analysis models, real-time fraud detection systems, and retail sales optimization using LSTM and ARIMA models. His professional affiliations include memberships in the American Statistical Association (ASA), IEEE Computer Society, and the Association for the Advancement of Artificial Intelligence (AAAI). In his current role as an AI Trainer at Outlier, Notue focuses on enhancing model performance through real-time evaluation and feedback. At African Think Tank, he led data collection and analysis to improve program effectiveness and optimize marketing strategies. His educational background includes a Master's in Data Science from Grand Canyon University and a Bachelor's degree in Petroleum Engineering from the University of Douala. Notue is currently completing his MS in Data Science at GCU, with additional certifications from Harvard University, Coursera, and Hugging Face.","voice":"af_heart","speed":1,"backgroundMusic":false,"musicType":"none","analysis":{"wordCount":744,"sentenceCount":35,"paragraphCount":1,"characterCount":6081,"readingTime":3,"complexity":"medium","contentType":"technical","contentHash":"560316a15f7c11a1440e1cec7586c9d1","estimatedTokens":2027,"metadata":{"avgWordsPerSentence":21.26,"avgSentencesPerParagraph":35}},"audio":null,"createdAt":"2025-09-06T19:11:23.773Z"}
