{"id":"ea2a8ee3-ab7a-4b93-8272-be276e7f9770","script":"Armand Junior Dongmo Notue is a Data Scientist with extensive expertise in Machine Learning, Deep Learning, NLP, and AI. His professional background includes developing real-time AI solutions, deploying ML pipelines, and optimizing predictive models to drive business impact. Key skills include advanced techniques such as transformers (BERT, GPT, T5), RNNs, CNNs, and GANs, along with a strong foundation in statistical analysis, data mining, feature engineering, and cloud computing. His recent experience includes roles as an AI Trainer at Outlier and a Data Analytics Intern at African Think Tank, where he led projects such as sentiment analysis using BERT models, AI-driven job market insights platforms, real-time fraud detection systems, and retail sales optimization through time series forecasting. Notue has a Master of Science in Data Science from Grand Canyon University (in progress) and a Master's degree in Reservoir Management from the University of Douala. His projects showcase his proficiency in building transformer-based NLP models for sentiment analysis, developing an AI-driven job market insights platform, implementing real-time fraud detection systems, optimizing retail sales through time series forecasting, and creating custom neural networks from scratch. Notable achievements include achieving 88.3% accuracy in sentiment analysis, increasing fraud detection accuracy by 35%, and improving forecasting accuracy by 20%. He is also certified in data science, machine learning with Python, and various NLP specializations from leading institutions like Harvard University, Coursera, and Hugging Face.","voice":"default_en","speed":1,"backgroundMusic":false,"musicType":"none","analysis":{"wordCount":744,"sentenceCount":35,"paragraphCount":1,"characterCount":6081,"readingTime":3,"complexity":"medium","contentType":"technical","contentHash":"560316a15f7c11a1440e1cec7586c9d1","estimatedTokens":2027,"metadata":{"avgWordsPerSentence":21.26,"avgSentencesPerParagraph":35}},"audio":null,"createdAt":"2025-09-07T19:03:41.536Z"}
